
&НаКлиенте
Процедура ВыполнитьКод(Команда)
	Если СокрЛП(СтрокаКода) = "" Тогда
		Предупреждение("Заполните Код!");
	Иначе
		ВыполнитьНаКлиенте(СтрокаКода);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНаКлиенте(СтрокаКода)
	Выполнить(СтрокаКода);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Если СокрЛП(СтрокаКода) <> "" Тогда
		Предупреждение("Код будет очищен!");
		СтрокаКода = "";
		ПрочитатьФайл(СтрокаКода);
	Иначе
		ПрочитатьФайл(СтрокаКода);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(СтрокаКода)
	
	Перем ВыбФайл, ДиалогОткрытияФайла, ИмяФайла, МассивФайлов, Режим, Строка, Строка1, Файл, Фильтр;
	
	СтрокаКода = "";
	#Если МобильноеПриложениеКлиент Тогда
		//Сообщить("Кнопку нажали!");
		Режим = РежимДиалогаВыбораФайла.Открытие;
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
		ДиалогОткрытияФайла.ПолноеИмяФайла = "";
		Фильтр = "Файл консоли кода, *.1ctxt)|*.1ctxt";
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = "Выберите файл";
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
			Для Каждого ИмяФайла Из МассивФайлов Цикл
				ВыбФайл = Новый Файл(ИмяФайла);
				//Сообщить(ИмяФайла
				//    + НСтр("ru = '; Размер = '; en = '; Size = '")
				//    + ВыбФайл.Размер());
				Файл = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
				СтрокаКода = "";
				Строка = Файл.ПрочитатьСтроку();
				Пока Строка <> Неопределено Цикл
					Если СтрокаКода <> "" Тогда
						СтрокаКода = СтрокаКода + Символы.ПС + Строка;
					Иначе
						СтрокаКода = СтрокаКода + Строка;
					КонецЕсли; 
					Строка = Файл.ПрочитатьСтроку();
				КонецЦикла;
				//Сообщить(СтрокаКода);
				Файл.Закрыть();
			КонецЦикла;
		Иначе
			Предупреждение(НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
		КонецЕсли;
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СтрокаКода, УникальныйИдентификатор);
	ПолучитьФайл(АдресВоВременномХранилище, , Истина);
КонецПроцедуры
